In [1]:
import pandas as pd

In [11]:
#series = 1 dementional
vacation= pd.Series(["summer","beach","sun","water"])
vacation

0    summer
1     beach
2       sun
3     water
dtype: object

# DataFrame = 2 dementional

In [13]:
equipments = pd.Series(["shoort","cream", "mask"])

In [18]:
holidays_data = pd.DataFrame({"holydays": vacation, "equipments": equipments})
holidays_data

  holydays equipments
0   summer     shoort
1    beach      cream
2      sun       mask
3    water        NaN

In [20]:
#import data
car_sales= pd.read_csv("car-sales.csv")

In [22]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [32]:
#exporting a dataframe
car_sales.to_csv("exported-car-sales.csv", index=False)

In [36]:
exported_car_sales= pd.read_csv("exported-car-sales.csv")

In [37]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00